app/Controllers/AdminController.php

    public function index()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $data = [
            'title' => 'Manajemen Pengguna',
            'admins' => $this->adminModel->findAll()
---
SELECT *
FROM `admin`

    public function store()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $rules = [
            'username' => 'required|min_length[5]|max_length[50]|is_unique[admin.username]',
            'password' => 'required|min_length[8]',
            'password_confirm' => 'matches[password]',
            'nama_lengkap' => 'required|min_length[3]|max_length[100]',
            'status_aktif' => 'required'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $data = [
            'username' => $this->request->getPost('username'),
            'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
            'nama_lengkap' => $this->request->getPost('nama_lengkap'),
            'status_aktif' => $this->request->getPost('status_aktif')
        ];

        $this->adminModel->insert($data);
---
INSERT INTO `admin` (`username`, `password`, `nama_lengkap`, `status_aktif`) VALUES ('Finna Agustina', '$2y$10$iOIuE8eRwzyGHJ.YbrcT2e56e9XNQP42BEDpgQl0hqdJLOk2nb/sm', 'Finna Agustina', 'aktif')

    public function delete($id)
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $admin = $this->adminModel->find($id);

        if (!$admin) {
            throw new PageNotFoundException('Pengguna tidak ditemukan');
        }

        if ($admin['id_admin'] == session()->get('id_admin')) {
---
SELECT *
FROM `admin`
WHERE `admin`.`id_admin` = '5'