app/Controllers/BookingController.php

SELECT *
FROM `dokter`
WHERE `status_aktif` = 'aktif'
---
    public function newRegistration()
    {
        $data = [
            'title' => 'Pendaftaran Online',
            'dokter' => $this->dokterModel->where('status_aktif', 'aktif')->findAll()