app/Controllers/LaporanController.php

SELECT `pendaftaran`.*, `pasien`.`nama_lengkap` as `nama_pasien`, `pasien`.`nik`, `dokter`.`nama_dokter`, `dokter`.`spesialisasi`
FROM `pendaftaran`
JOIN `pasien` ON `pasien`.`id_pasien` = `pendaftaran`.`id_pasien`
JOIN `dokter` ON `dokter`.`id_dokter` = `pendaftaran`.`id_dokter`
WHERE `tanggal_kunjungan` >= '2025-06-17'
AND `tanggal_kunjungan` <= '2025-06-17'
---
    public function view($id)
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $laporan = $this->laporanModel->getLaporanWithAdmin()->find($id);
        if (!$laporan) {
            throw new PageNotFoundException('Laporan tidak ditemukan');
        }

        // Get detail pendaftaran berdasarkan periode laporan
        $pendaftaran = $this->pendaftaranModel->getPendaftaranWithRelations()
            ->where('tanggal_kunjungan >=', $laporan['periode_mulai'])
            ->where('tanggal_kunjungan <=', $laporan['periode_selesai'])
            ->findAll();

SELECT `pendaftaran`.*, `pasien`.`nama_lengkap` as `nama_pasien`, `pasien`.`nik`, `dokter`.`nama_dokter`, `dokter`.`spesialisasi`
FROM `pendaftaran`
JOIN `pasien` ON `pasien`.`id_pasien` = `pendaftaran`.`id_pasien`
JOIN `dokter` ON `dokter`.`id_dokter` = `pendaftaran`.`id_dokter`
WHERE `tanggal_kunjungan` >= '2025-06-17'
AND `tanggal_kunjungan` <= '2025-06-17'
---
    public function exportPDF($id)
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $laporan = $this->laporanModel->getLaporanWithAdmin()->find($id);
        if (!$laporan) {
            throw new PageNotFoundException('Laporan tidak ditemukan');
        }

        $pendaftaran = $this->pendaftaranModel->getPendaftaranWithRelations()
            ->where('tanggal_kunjungan >=', $laporan['periode_mulai'])
            ->where('tanggal_kunjungan <=', $laporan['periode_selesai'])
            ->findAll();