app/Controllers/PasienController.php

SELECT *
FROM `pasien`
---
    public function index()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $data = [
            'title' => 'Manajemen Pasien',
            'pasien' => $this->pasienModel->findAll()